Tsar/smart_home/ESP8266_Firmware/src/main.cpp
private:
  char* buffer_;
  size_t pos_;
};

// Fill binInfoStorage
void generateInfoBinary(uint8_t version) {
  const bool v2 = version >= 2;

  const String name = homeCfg.getName();
  const String additionalBlob = homeCfg.getAdditionalBlob();

  const size_t sz = WL_MAC_ADDR_LENGTH                       // MAC size
                  + 2 + name.length()                        // name length and name size
                  + (v2 ? 1 : 0)                             // input pin
                  + 1 + DIMMERS_COUNT * (v2 ? 9 : 8)         // dimmers info size
                  + 1 + SWITCHERS_COUNT * (v2 ? 3 : 2)       // switchers info size
                  + (v2 ? 2 + additionalBlob.length() : 0);  // some App's GUI display settings
  binInfoStorage.resize(sz);

  UnalignedBinarySerializer serializer(binInfoStorage.data());
  serializer.writeWiFiMacAddress();
  serializer.writeString(name);
  if (v2) {
    serializer.writeUInt8(INPUT_PIN);
  }
  serializer.writeUInt8(DIMMERS_COUNT);
  for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
    if (v2) {
      serializer.writeUInt8(DIMMER_PINS[i]);
    }
    serializer.writeUInt16(homeCfg.getDimmerValue(i));
    serializer.writeUInt16(dimmersSettings[i].valueChangeStep);
    serializer.writeUInt16(dimmersSettings[i].minLightnessMicros);
    serializer.writeUInt16(dimmersSettings[i].maxLightnessMicros);
  }
  serializer.writeUInt8(SWITCHERS_COUNT);
  for (uint8_t i = 0; i < SWITCHERS_COUNT; ++i) {
    if (v2) {
      serializer.writeUInt8(SWITCHER_PINS[i]);
    }
    serializer.writeUInt8(homeCfg.getSwitcherValue(i));
    serializer.writeUInt8(homeCfg.isSwitcherInverted(i));
  }
  if (v2) {
    serializer.writeString(additionalBlob);
  }

  if (serializer.getWrittenSize() != sz) {
    Serial.printf("WARNING: Serialized: %d, expected: %d\n", serializer.getWrittenSize(), sz);
  }
}

void handleGetInfo() {
  const auto tsStart = micros64();

  if (!checkPassword()) return;

  if (server.hasArg("binary")) {
    generateInfoBinary(server.hasArg("v") ? server.arg("v").toInt() : 1);
    server.send(200, "application/octet-stream", binInfoStorage.data(), binInfoStorage.size());
  } else {
    server.send(200, "application/json", generateInfoJson(server.hasArg("minimal")));
  }

  const auto tsEnd = micros64();
  Serial.printf("Handled %s, spent %.2lf ms\n", server.uri().c_str(), (tsEnd - tsStart) / 1000.0);
}

void handleSetupWiFi() {
  if (!checkPassword()) return;

  if (!server.hasArg("ssid") || !server.hasArg("passphrase")) {
    sendBadRequest();
    return;
  }

  wifiSetupState = WiFiSetupState::IN_PROGRESS;
  server.send(200, "text/plain", "TRYING_TO_CONNECT");
  Serial.printf("Sent response to %s\n", server.uri().c_str());
  delay(100);  // задержка нужна, чтобы успеть отправить ответ до попытки
  disconnectWiFi();
  wifiSetupState = connectToWiFi(server.arg("ssid").c_str(), server.arg("passphrase").c_str(), false)
                      ? WiFiSetupState::SUCCESS
                      : WiFiSetupState::FAIL;
  // Если пытаться отправить ответ сервера здесь, то клиент получает ошибку:
  // curl скажет "empty reply from server", android скажет "unexpected end of stream on com.android.okhttp.Address"
}

void handleGetSetupWiFiState() {
  if (!checkPassword()) return;

  String result;
  switch (wifiSetupState) {
    case WiFiSetupState::NONE:
      result = "NONE";
      break;
    case WiFiSetupState::IN_PROGRESS:
      result = "IN_PROGRESS";
      break;
    case WiFiSetupState::FAIL:
      result = "FAIL:" + String(wifiConnectResult);
      break;
    case WiFiSetupState::SUCCESS:
      result = "SUCCESS:" + WiFi.localIP().toString();
      break;
  }
  server.send(200, "text/plain", result);
  Serial.printf("Handled %s (response: %s)\n", server.uri().c_str(), result.c_str());
}

void handleResetWiFi() {
  if (!checkPassword()) return;

  server.send(200, "text/plain", "OK");
  delay(100);
  Serial.println("Reset wi-fi credentials by request");
  WiFi.disconnect(true);
  enableAccessPoint();
}

void handleTurnOffAccessPoint() {
  if (!checkPassword()) return;

  server.send(200, "text/plain", "OK");
  delay(100);
  WiFi.softAPdisconnect(true);
  isAccessPointEnabled = false;
  Serial.println("Access point disabled by request");
}

void handleSetValues() {
  const auto tsStart = micros64();

  if (!checkPassword()) return;

  bool dimmersChanged = false;
  for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
    const String argName = DIMMER_PREFIX + String(i);
    if (server.hasArg(argName)) {
      const int32_t value = server.arg(argName).toInt();
      if (value < 0 || value > DIMMER_MAX_VALUE) {
        sendBadRequest();
        return;
      }
      if (value != homeCfg.getDimmerValue(i)) {
        homeCfg.setDimmerValue(i, value);
        dimmersChanged = true;
      }
    }
  }

  bool switchersChanged = false;
  for (uint8_t i = 0; i < SWITCHERS_COUNT; ++i) {
    const String argName = SWITCHER_PREFIX + String(i);
    if (server.hasArg(argName)) {
      const bool value = server.arg(argName).toInt();
      if (value != homeCfg.getSwitcherValue(i)) {
        homeCfg.setSwitcherValue(i, value);
        switchersChanged = true;
      }
    }
  }

  if (dimmersChanged || switchersChanged) {
    if (dimmersChanged) {
      fillDimmerValues();
    }
    if (switchersChanged) {
      applySwitcherValues();
    }
    server.send(200, "text/plain", "ACCEPTED\n");

    const auto tsSaveCfgStart = micros64();
    homeCfg.save();

    const auto tsEnd = micros64();
    Serial.printf(
      "Handled %s, spent %.2lf ms (%.2lf for handling + %.2lf for saving to flash), accepted new values\n", server.uri().c_str(),
      (tsEnd - tsStart) / 1000.0, (tsSaveCfgStart - tsStart) / 1000.0, (tsEnd - tsSaveCfgStart) / 1000.0
    );
  } else {
    server.send(200, "text/plain", "NOTHING_CHANGED\n");

    const auto tsEnd = micros64();
    Serial.printf("Handled %s, spent %.2lf ms, nothing was changed\n", server.uri().c_str(), (tsEnd - tsStart) / 1000.0);
  }
}

void handleSetSettings() {
  if (!checkPassword()) return;

