Tsar/smart_home/ESP8266_Firmware/src/main.cpp
  if (server.hasArg("name")) {
    homeCfg.setName(server.arg("name"));
  }

  bool resetCfgHappened;
  for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
    const String argName = DIMMER_PREFIX + String(i);
    if (server.hasArg(argName)) {
      const String settingsStr = server.arg(argName);
      const int comma1Pos = settingsStr.indexOf(",");
      if (comma1Pos < 0) {
        homeCfg.loadOrReset(resetCfgHappened);  // used to revert cfg
        sendBadRequest();
        return;
      }
      const int comma2Pos = settingsStr.indexOf(",", comma1Pos + 1);
      if (comma2Pos < 0) {
        homeCfg.loadOrReset(resetCfgHappened);  // used to revert cfg
        sendBadRequest();
        return;
      }
      smart_home::DimmerSettings settings;
      settings.valueChangeStep = settingsStr.substring(0, comma1Pos).toInt();
      settings.minLightnessMicros = settingsStr.substring(comma1Pos + 1, comma2Pos).toInt();
      settings.maxLightnessMicros = settingsStr.substring(comma2Pos + 1).toInt();
      if (!settings.areValid()) {
        homeCfg.loadOrReset(resetCfgHappened);  // used to revert cfg
        sendBadRequest();
        return;
      }
      homeCfg.setDimmerSettings(i, settings);
    }
  }

  for (uint8_t i = 0; i < SWITCHERS_COUNT; ++i) {
    const String argName = SWITCHER_PREFIX + String(i);
    if (server.hasArg(argName)) {
      const bool inverted = server.arg(argName).toInt();
      homeCfg.setSwitcherInverted(i, inverted);
    }
  }

  if (server.hasArg("blob")) {
    homeCfg.setAdditionalBlob(server.arg("blob"));
  }

  homeCfg.save();
  server.send(200, "text/plain", "ACCEPTED\n");
  Serial.printf("Handled %s\n", server.uri().c_str());
}

void handleSetPassword() {
  if (!checkPassword()) return;

  if (!server.hasArg("password")) {
    sendBadRequest();
    return;
  }

  homeCfg.setPassword(server.arg("password"));
  homeCfg.save();
  server.send(200, "text/plain", "ACCEPTED\n");
  Serial.printf("Handled %s\n", server.uri().c_str());
}

void handleNotFound() {
  server.send(404, "text/plain", "Not Found");
  Serial.printf("Sent 404 for %s\n", server.uri().c_str());
}

void udpHandlePacket() {
  int packetSize = udp.parsePacket();
  if (packetSize == static_cast<int>(UDP_SCAN_REQUEST.length())) {
    int len = udp.read(udpInputBuffer, packetSize);
    udpInputBuffer[len] = 0;
    if (UDP_SCAN_REQUEST == String(udpInputBuffer)) {
      const String response = "MAC=" + WiFi.macAddress() + "\nNAME=" + homeCfg.getName();
      udp.beginPacket(udp.remoteIP(), UDP_RESPONSE_PORT);  // unicast back
      udp.write(response.c_str());
      udp.endPacket();
      Serial.printf("Handled UDP scan request #%d\n", ++udpScanCounter);
    }
  }
}

void resetWiFiResetSequence() {
  homeCfg.setWiFiResetSequenceLengthAndSave(0);
  Serial.printf("Done reset wi-fi reset sequence length to zero; current uptime = %ld ms\n", millis());
}

void incrementWiFiResetSequence() {
  const uint8_t currentSeqLength = homeCfg.getWiFiResetSequenceLength();
  homeCfg.setWiFiResetSequenceLengthAndSave(currentSeqLength + 1);

  const auto currentUptime = millis();
  Serial.printf("Done wi-fi reset sequence length incrementation to %d; current uptime = %ld ms\n", currentSeqLength + 1, currentUptime);

  const uint32_t resetSeqLengthUptime = WIFI_RESET_SEQUENCE[currentSeqLength] * 1.2;
  if (resetSeqLengthUptime >= currentUptime) {
    wifiResetSequenceDetectorTicker.once_ms(resetSeqLengthUptime - currentUptime, resetWiFiResetSequence);
  } else {
    resetWiFiResetSequence();
  }
}

// Проверка и обработка кодовой последовательности продолжительности включений контроллера для сброса настроек wi-fi
void checkWiFiResetSequence() {
  const uint8_t currentSeqLength = homeCfg.getWiFiResetSequenceLength();
  if (currentSeqLength >= WIFI_RESET_SEQUENCE.size()) {
    homeCfg.setPassword(DEFAULT_HTTP_PASSWORD);  // пароль для HTTP тоже сбрасываем, чтобы можно было добавить устройство как свежее
    homeCfg.setWiFiResetSequenceLengthAndSave(0);

    Serial.println("Reset wi-fi credentials by code sequence of uptimes");
    WiFi.disconnect(true);

    // Поморгать встроенным светодиодом 5 раз
    for (uint8_t i = 0; i < 5; ++i) {
      digitalWrite(LED_BUILTIN, HIGH);
      delay(60);
      digitalWrite(LED_BUILTIN, LOW);
      delay(60);
    }
  } else {
    const auto currentUptime = millis();
    const uint32_t incrementSeqLengthUptime = WIFI_RESET_SEQUENCE[currentSeqLength] * 0.8;
    if (incrementSeqLengthUptime >= currentUptime) {
      const uint32_t interval = incrementSeqLengthUptime - currentUptime;
      wifiResetSequenceDetectorTicker.once_ms(interval, incrementWiFiResetSequence);
    } else {
      Serial.println("Failed to schedule wi-fi reset sequence length incrementation: it should have been in the past");
    }
  }
}

void setup() {
  for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
    pinMode(DIMMER_PINS[i], OUTPUT);
    digitalWrite(DIMMER_PINS[i], LOW);
  }
  for (uint8_t i = 0; i < SWITCHERS_COUNT; ++i) {
    pinMode(SWITCHER_PINS[i], OUTPUT);
  }

  bool resetCfgHappened;
  homeCfg.loadOrReset(resetCfgHappened);

  dimmersSettings = homeCfg.getDimmersSettings();
  fillDimmerValues();
  createEventsQueue();
  applySwitcherValues();

  timer1_attachInterrupt(onTimerISR);
  timer1_enable(TIM_DIV16, TIM_EDGE, TIM_SINGLE);

  pinMode(INPUT_PIN, INPUT);
  attachInterrupt(digitalPinToInterrupt(INPUT_PIN), onInputFall, FALLING);

  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, LOW);

  Serial.begin(115200);
  Serial.printf("\n%s\nDevice name: %s, HTTP password: '%s'\n",
                resetCfgHappened ? "CONFIGURATION RESET HAPPENED!" : "Configuration loaded successfully",
                homeCfg.getName().c_str(), homeCfg.getPassword().c_str()
  );

  checkWiFiResetSequence();

  WiFi.persistent(true);
  WiFi.setAutoConnect(false);
  WiFi.setAutoReconnect(true);

  // Не используем WiFi.disconnect и WiFi.softAPdisconnect, чтобы не трогать сохранённые настройки, а то reset в неподходящий момент всё портит
  disconnectWiFi();
  WiFi.enableAP(false);
  isAccessPointEnabled = false;

  // This should partly help for quick responses, details: https://github.com/esp8266/Arduino/issues/6886
  if (!WiFi.setSleepMode(WIFI_NONE_SLEEP)) {
    Serial.println("Failed to set wi-fi sleep mode to None!");
  }

  station_config stationCfg;
  wifi_station_get_config_default(&stationCfg);
  const char* cfgSsid = reinterpret_cast<char*>(stationCfg.ssid);
  const char* cfgPassphrase = reinterpret_cast<char*>(stationCfg.password);

  if (strlen(cfgSsid) > 0) {
    Serial.println("Found wi-fi credentials");
    connectToWiFi(cfgSsid, cfgPassphrase, true);
  } else {
    Serial.println("No wi-fi credentials found");
    enableAccessPoint();
  }

  server.on("/get_info", HTTP_GET, handleGetInfo);
  server.on("/setup_wifi", HTTP_POST, handleSetupWiFi);
  server.on("/get_setup_wifi_state", HTTP_GET, handleGetSetupWiFiState);
  server.on("/reset_wifi", HTTP_GET, handleResetWiFi);
  server.on("/turn_off_ap", HTTP_GET, handleTurnOffAccessPoint);
  server.on("/set_values", HTTP_ANY, handleSetValues);
  server.on("/set_settings", HTTP_POST, handleSetSettings);
  server.on("/set_password", HTTP_POST, handleSetPassword);
  server.onNotFound(handleNotFound);

  const char* headerKeys[] = {"Password"};
  server.collectHeaders(headerKeys, 1);

  server.begin();
  Serial.printf("Started HTTP server on port %d\n", HTTP_SERVER_PORT);
}

void loop() {
  server.handleClient();
  udpHandlePacket();
}
